IDEA StatiCa Open Model
ConnectionCheckRes.CheckResAnchor Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 List of check results for anchors
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<CheckResAnchor> CheckResAnchor { get; set; }
Public Property CheckResAnchor As List(Of CheckResAnchor)
	Get
	Set
public:
property List<CheckResAnchor^>^ CheckResAnchor {
	List<CheckResAnchor^>^ get ();
	void set (List<CheckResAnchor^>^ value);
}
Property Value
Type: List<CheckResAnchor>
See Also
Reference
ConnectionCheckRes Class
IdeaRS.OpenModel.Connection Namespace